## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/da9fc0e0-cee6-4a2c-a9c1-7a1f7c24fa5c).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpa5tu9sgr/plan`

```diff
2024-12-02T21:40:28.138Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T21:40:28.138Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T21:40:28.138Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T21:40:28.138Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T21:40:28.138Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T21:40:28.138Z [INFO]  Go runtime version: go1.21.11
2024-12-02T21:40:28.138Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmpa5tu9sgr/plan"}
2024-12-02T21:40:28.138Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T21:40:28.138Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T21:40:28.138Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T21:40:28.138Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T21:40:28.138Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T21:40:28.139Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T21:40:28.139Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T21:40:28.139Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T21:40:28.139Z [INFO]  CLI command args: []string{"show", "/tmp/tmpa5tu9sgr/plan"}
2024-12-02T21:40:28.232Z [DEBUG] checking for provisioner in "."
2024-12-02T21:40:28.232Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T21:40:28.232Z [DEBUG] created provider logger: level=debug
2024-12-02T21:40:28.232Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:40:28.246Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T21:40:28.247Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=803
2024-12-02T21:40:28.247Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T21:40:28.257Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T21:40:28.257Z
2024-12-02T21:40:28.272Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin1169985049 network=unix timestamp=2024-12-02T21:40:28.272Z
2024-12-02T21:40:28.272Z [DEBUG] provider: using plugin: version=6
2024-12-02T21:40:28.304Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:40:28.306Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=803
2024-12-02T21:40:28.306Z [DEBUG] provider: plugin exited
2024-12-02T21:40:28.306Z [DEBUG] created provider logger: level=debug
2024-12-02T21:40:28.306Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:40:28.312Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T21:40:28.312Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=812
2024-12-02T21:40:28.312Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T21:40:28.315Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T21:40:28.315Z
2024-12-02T21:40:28.331Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin2206150634 network=unix timestamp=2024-12-02T21:40:28.331Z
2024-12-02T21:40:28.331Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:40:28.342Z [DEBUG] No provider meta schema returned
2024-12-02T21:40:28.342Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:40:28.343Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=812
2024-12-02T21:40:28.343Z [DEBUG] provider: plugin exited
2024-12-02T21:40:28.343Z [DEBUG] created provider logger: level=debug
2024-12-02T21:40:28.343Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:40:28.349Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T21:40:28.349Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=821
2024-12-02T21:40:28.349Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T21:40:28.399Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T21:40:28.399Z
2024-12-02T21:40:28.418Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin4225598115 network=unix timestamp=2024-12-02T21:40:28.418Z
2024-12-02T21:40:28.418Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:40:28.438Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:40:28.600Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x94\x92]l\xe5\xc7\xcf~L\xfbv?\xba\xcf~\xf6\xe9\xf2\xd1\xe1m\xa13\xdd7-\xee8pN41$M\xb8\x93\x90u\x98}\xbb\x9dt>63\xb3\xbd\xdb%^(r\xa17z!F\xbd R\x92\xc6\x83\x8d$\xa8QCbb$\xc1\xf0\xc6n\x8c\xcc;3m\xc4zѝy\xbf\xe7\xff<\xf3\xcc<\xfd\xfb\xca7\xddo?\xbeqSI\x83x*I\x90\x9c\xbb\xf4ݭ\xfa\xb3\xc1\xe5s\xdd埒H\xbf\xec~\x91\xa0\x89\xc1\xdd$\xc4&	\x89\x81\x84\x92<@+$\x8e\x9f]\xb8\x96\xa0I\x97J$\xef\xc7#\x838(\x93IB0\x84Cr\x8aI\xe0\xd5\xdb\xd7DN.\xc4+	iL,\x89'/-\x98\xaf\xc6&A3r\x96\x91\xf0\xad\xdb\xd7\x80º\xc6a9G+d ?\xbfy]\xf4\xa0!\xf0KX=\x80 \xe7'	!P\xc0\x82\x9c\xa392\x88\xe7\xbf
2024-12-02T21:40:28.600Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xdc!\xb0\x83CPĢ\x9c\xa3@\xfe\xfa\xdbϢE
2024-12-02T21:40:28.600Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xceg\x96\x82\x96\xe42͑!\\xfe\xe1\x89&IjJC+\xf2\x92\xc2/\xbe+Q\x89d`%\x9c,\x88(\x8fR i\xbc\xfa\xf69\xc1\xb2p)dY\xa8bU\xde@\x81d\xf0\xd2G\x86\xe1\xbcð7ʛh\x8ed\xf1\xdc\xcaE\xd1.\x9d\xa0]6\xe3\xe6 \xe3\xed\xe5;Y\x9a$ \x85 \x8c\xe1\x98,S 9\\xb9~*N%\x92\x87\xbbab\xb6\xe0\x99b ^d*\x8b'\x92\xd2\xc0 J\xa53\xd9a\xf1؀\x9f.\xbf!\xaa
2024-12-02T21:40:28.600Z [DEBUG] provider.terraform-provider-akash_v0.1.1: p6|\xb3؊[\xe5m4G\xf2\xf8ک\x97\xe34I\x8a\xb0?hV\x84\xed\xb8]\xfe7R\xc0[wO\x88\xb2\xbc6+\xc1\xdc!\x8f\xd3R\xc4s߿"XΦ\xa9D*p9\x94\x97a'd:IH&qR\xa6H	\x9f?qZ\xc8#\xf0G9\xb0F`'\xeeX?80\x84{0\x84]\xb8+`|齀\x8d\xc2\xe9j\xc0Fa
2024-12-02T21:40:28.600Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa76\x82\x9f,\xbf.2\xabp6\xb0*(\xa8\xc8j!\xbf\xba	\xf9B\xb1T\xae\x8cT\x81Ġ\xdb\xedƱ{\xe5Nv|\xfa?\xb1j\x89ġ۽y\xe3\xc7\xfbcؽrS\xfc\x8eתU\x92޽\xfb\xe2/\x86\xdd3\xab\x97\xe3\x8c\xfd\x8bz\x9a\xd52\xb9\xc7$\xddi\xdb>K\xe8\xad6Kۚ\xedx\w\xec\x86Ƕ\xeb\xeeR\xcbwTn\x9aF\xcb7tհ}\xeeښ\xa9\xce\x9a\xaf\xb4fY\xed`\xdbd\xbb\xf4~\x9aښe\xb5\xba(\xd8=\xa346\xad\xf7\xb3\x95\xf1ɹYV\xfb\xbf\xc9-n\xfb\x8a\xc8\xef?F\x90\xdf?\xd86<\x9f\xebQ\xf4\x9cc\x88\xe0\xff6l\xc7ߎV\xacE\xef\xf9\xf1\xc1\xe8C\xbafj\xee\xc1\xb6\xe9\xb3\xf1\x87
2024-12-02T21:40:28.600Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xb1\x8cm\xb7\xc3#k\xbf\xe6\xf1\xc0y\xc8\덫@ox\x9a\xe2M\xfb)ns\xd7\xd0Y\xb9\x97\xa8!o:,\xdf{\xb0\xbdG\xa1Y\xb7ͳ\xfe\xea2\x9a6\xeb\xf5\xc5ùFG\xf3\xf93|i"6E\xc2\xf1\xd9\xe9\xbd\xca\x97k>?\xc0]ߘ7t\xcd\xe7\xac؃C\xa7鰝M\xc3_hUt\xc7R4o\xc1\xd0\xb7\xa56\x9d\xa9\x96\xd9n\xb6\xd2\xe46w\xb50\x88M\xf5\x97\xf7ujʌ2\xa3Z\xbe\xe9\x89\xecm\xfdu\xe5w;\x9c\xa9\xfd\xad\xd5POȮ\x88\xdd\xff\xc8\x9f\xbb\xae6\xef\xb8V4\xf9T\xd3Q\xfd\xf9\x96\xeb\xf8NgV\xf5\xe7g\xa3\x80\xb0\xe9\xc1\xc7\xcd\xd8יV\xf6*\xb5GE=\xf9H^cQ\xed05Z\xed\xdaL\xe1H\xff{\xbc\x91}\xa6\xd4\xf6(\xd3QV8\x8aX\xce\xde'I\x89\xaa\xa3\x9dY\x9aa+\xe2\x93{\xb6\xe9:\xa3\xc1\xdd)mQ\xf3T\x81E\x9f\x8c۶}\xc3⡟\x8b\xeeԖ\xeb\xe8g\xa3e\xbe\xed\xf3\xe3l4\xbaU\xbd%\xafnv\xfbx]\xb3\xbbg\x8f"\x9a\x9e\xc9y\x8b\xa33Չl\x99\x8f\xdb\xf1y蕣#\xd5t\xf4\xc5z\xd0J\x98kͭ9\xcd]\\xbf\xf5|\xa7e\xb1RT\xa4\xccv\xc3m۶v\xd4\xe4VO=}\x817\xda&gë'-\xcd]\xac[\xeb1\x96\xae\x99\xe6\xfa\x8c\x9ag\xad=̋\xb1\xe8kV\x8f9\xee\xa2\xd7\xd2t\xae\x9a\xdaw=Uw\\xae*k{\x9b
2024-12-02T21:40:28.603Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xf6\xea\xa9.o\x9e\xef.\xadC\xc5pT\xb3m\xf1c\xfc\xa8\xae}Z\xa9)5\xb5gs\xbd\xdf\xfbo\xa8\xde	\6p\xb8\xd3\xf0\x9c#,u\xb8\xe3-y\xbaf\x9aG\xfe  \xff\xff\xd50\xb5\xa6	  
2024-12-02T21:40:28.603Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=821
2024-12-02T21:40:28.603Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
